package pkg;

public class Main {

	public static void main(String[] args) {
		/*
		 * 9월 18일(월) ~ 9월 24일(일) 회고록
		 * 
		 * 이번주는 네트워크 관련 공부를 주력으로 했다.
		 * 특히 HTTP, HTTPS에 대한 내용을 공부해서 발표했는데,
		 * 나름 열심히 준비했다고 생각했는데, 아니었다.
		 * 
		 * 내가 미처 생각지 못한 부분.
		 * 뭐라고 해야할까. 전체적인 설명을 해야하는데 딱 한 군데에 꽂혀서 그쪽으로만 했다.
		 * 예를 들면 HTTP의 역사, 정의, 앞으로의 방향 등을 공부해서 알아냈어야 하는건데,
		 * 단순히 HTTP와 HTTPS의 차이점에 대해 공부한 것 같아 부족함이 많이 느껴진다.
		 * 
		 * 코드 공부를 하는 것도 아닌데, '아!' 하고 깨달은 시간이었다.
		 * 팀장님으로부터의 가르침으로 나의 잘못된 버릇을 꺠달았다.
		 * 확실하지 않은 정보를 믿고 사용한다는 점. 두루뭉실하게 알고 안다고 말하는 점 등이다.
		 * 미처 생각지 못했다. 그래도 문제점을 발견했으니 최대한 사실 관계로만 가지고 공부할 예정이다.
		 * 
		 * 나는 아직 논리적이지 못한 것 같은 단점이 있다.
		 * 이 기회에 계속 인지하여 논리적인 성격으로 바꾸고 싶다.
		 * 그렇기 위해서 내가 취해야할 행동을 생각해봤는데,
		 * 결론은 행동하기 전, 그것에 대해 디테일한 생각을 해보는 것이라고 결론 내렸다.
		 * 당장 바꾸기는 어렵겠지만, 차츰 나아지게끔. 인정 받을 수 있도록 노력하겠다.
		 * 
		 * 오늘도 화이팅이다!!!
		 * 
		 * 
		 * 
		 */
	}

}
